---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnequaled
source: html/a37172b9-0e93-557b-e506-8cc4f04f7951.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DimensionUnequaled Property

Dimension had to be unlocked and un-EQed in order to remove sketch over-constraining.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionUnequaled { get; }
```